app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "San Pedro Sula"], ["created_at", "2018-02-20 07:02:38.782134"], ["updated_at", "2018-02-20 07:02:38.782134"]]
---
	def create
		@location = Location.new(location_params)

		if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def update
		@location = Location.find(params[:id])