app/controllers/recordings_controller.rb

	def create
		@location = Location.find(params[:location_id])
		@recording = @location.recordings.create(recording_params)
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recordings" ("temp", "status", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["temp", 32], ["status", "Calor"], ["location_id", 1], ["created_at", "2018-02-20 08:02:24.944585"], ["updated_at", "2018-02-20 08:02:24.944585"]]

	def destroy
		@location = Location.find(params[:location_id])
		@recording = @location.recordings.find(params[:id])
		@recording.destroy
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recordings".* FROM "recordings" WHERE "recordings"."location_id" = ? AND "recordings"."id" = ? LIMIT ?  [["location_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "recordings" WHERE "recordings"."id" = ?  [["id", 2]]